go-go-golems/esp32-s3-m5/0110-papers3-epd-density-step-response/components/epd_painter/src/EPD_Painter.cpp
#ifdef ARDUINO
#include "esp32-hal.h"
#endif
#include <string.h>
#include <cstring>
#include "build_opt.h"
#include "esp_timer.h"
#include "esp_task_wdt.h"
#include "esp_err.h"
#include "esp_heap_caps.h"
#include "esp_rom_gpio.h"
#include <esp_private/periph_ctrl.h>
#include <esp_private/gdma.h>
#include <hal/dma_types.h>
#include <hal/gpio_hal.h>
#include <soc/lcd_cam_struct.h>
#include <soc/gdma_struct.h>
#include "EPD_Painter.h"
#include <epd_painter_powerctl.h>
#include "epd_painter_bootctl.h"
#include "epd_pin_driver.h"

#ifdef ARDUINO
  #include "Wire.h"
#else
  #include "freertos/FreeRTOS.h"
  #include "freertos/task.h"
  #include "freertos/semphr.h"
#endif

// Define EPD_ASM_TIMING to enable assembly-function timing output.
// Prints compact_pixels, epd_painter_ink, and convert_packed_fb_to_ink
// durations to serial each frame so you can compare old vs new .S builds.
//#define EPD_ASM_TIMING

// LCD_CAM signal indices for the 8 parallel data lines
static const uint8_t kDataSignals[8] = {
  LCD_DATA_OUT0_IDX,
  LCD_DATA_OUT1_IDX,
  LCD_DATA_OUT2_IDX,
  LCD_DATA_OUT3_IDX,
  LCD_DATA_OUT4_IDX,
  LCD_DATA_OUT5_IDX,
  LCD_DATA_OUT6_IDX,
  LCD_DATA_OUT7_IDX,
};


// Assembly routines — see EPD_Painter.S for full documentation
extern "C" void epd_painter_compact_pixels(
  const uint8_t *input, uint8_t *output, uint32_t size);

// =============================================================================
// compact_pixels_rotated_cw
//
// Combines 90° clockwise rotation and 8bpp→2bpp compaction in one pass.
//
// The portrait canvas is src_w wide × src_h tall (e.g. 540×960).
// The physical panel is src_h wide × src_w tall (e.g. 960×540).
//
// Rotation mapping (clockwise):
//   canvas pixel (col=x, row=y)  →  panel pixel (col=y, row=src_w-1-x)
//
// Processed in blocks of 16 portrait rows so the working set (16 × src_w bytes)
// stays warm in cache across all src_w column iterations within each block,
// avoiding repeated PSRAM fetches for the strided column access pattern.
//
// src_h must be a multiple of 16. src_w must be a multiple of 4.
// =============================================================================
static IRAM_ATTR void compact_pixels_rotated_cw(
    const uint8_t* src, uint8_t* dst, int src_w, int src_h)
{

    const int out_stride = src_h / 4;   // packed bytes per output row (e.g. 240)

    for (int rb = 0; rb < src_h; rb += 16) {
        for (int cx = 0; cx < src_w; cx++) {
            // CW: canvas column cx → output row (src_w - 1 - cx)
            uint8_t* out       = dst + (src_w - 1 - cx) * out_stride + rb / 4;
            const uint8_t* col = src + rb * src_w + cx;

            // 16 portrait rows → 4 packed output bytes, 4 pixels per byte.
            // Fully unrolled; all 16 loads are to addresses within the current
            // 16-row block (rb * src_w .. (rb+15) * src_w), which is warm in cache.
            out[0] = ((col[ 0        ] & 3) << 6) | ((col[  src_w] & 3) << 4)
                   | ((col[ 2*src_w  ] & 3) << 2) |  (col[ 3*src_w] & 3);
            out[1] = ((col[ 4*src_w  ] & 3) << 6) | ((col[ 5*src_w] & 3) << 4)
                   | ((col[ 6*src_w  ] & 3) << 2) |  (col[ 7*src_w] & 3);
            out[2] = ((col[ 8*src_w  ] & 3) << 6) | ((col[ 9*src_w] & 3) << 4)
                   | ((col[10*src_w  ] & 3) << 2) |  (col[11*src_w] & 3);
            out[3] = ((col[12*src_w  ] & 3) << 6) | ((col[13*src_w] & 3) << 4)
                   | ((col[14*src_w  ] & 3) << 2) |  (col[15*src_w] & 3);
        }
    }

}

// =============================================================================
// compact_pixels_180
//
// 180° rotation + 8bpp→2bpp compaction for a landscape (ROTATION_0) buffer.
// A 180° turn of a row-major image is just a full reversal of the pixel order
// (pixel (x,y) → (W-1-x, H-1-y) == linear index i → N-1-i).  So we read the
// source backwards in groups of 4 and pack forward, using the same MSB-first
// nibble layout as the linear pack — keeping panel coordinates correct.
//
// size must be a multiple of 4.
// =============================================================================
static IRAM_ATTR void compact_pixels_180(
    const uint8_t* src, uint8_t* dst, uint32_t size)
{
    const uint32_t nbytes = size / 4;
    const uint8_t* s = src + size - 1;        // last source pixel
    for (uint32_t b = 0; b < nbytes; b++) {
        dst[b] = ((s[ 0] & 3) << 6) | ((s[-1] & 3) << 4)
               | ((s[-2] & 3) << 2) |  (s[-3] & 3);
        s -= 4;
    }
}

extern "C" void epd_painter_convert_packed_fb_to_ink(
  const uint8_t *packed_fb, uint8_t *output, uint32_t length,
  const uint8_t *waveform, uint32_t chunk_flags);

extern "C" uint32_t epd_painter_ink(uint8_t *packed_fastbuffer, uint8_t *packed_screenbuffer, uint32_t length, uint32_t bitmask);

static inline void epd_gpio_func_sel(int pin) {
  esp_rom_gpio_pad_select_gpio((gpio_num_t)pin);
}


#define PASS_COUNT 13


EPD_Painter::EPD_Painter(const Config &config, bool portrait) {
  _config = config;
  _preset = &config;
  if (portrait) _config.rotation = Rotation::ROTATION_CW;
}


void EPD_Painter::setQuality(Quality quality) {
  _config.quality = quality;
}

// =============================================================================
// sendRow()
// =============================================================================
void EPD_Painter::sendRow(bool firstLine, bool lastLine, bool skipRow) {
  (void)skipRow;
  // Wait for LCD peripheral to finish consuming the previous row.
  // This also guarantees the previously-started DMA transfer is complete,
  // since the LCD FIFO cannot drain faster than DMA fills it.
  //long count=0;
  while (LCD_CAM.lcd_user.lcd_start) {}
  //printf("yielded %d \n",count);
  //delayMicroseconds(4);

  // dma_buffer points at the buffer the CPU just finished writing.
  // Start DMA on its matching descriptor, then swap so the next
  // convert_packed_fb_to_ink() writes into the now-idle buffer.
  //delayMicroseconds(10);
  dma_descriptor_t *desc;
  if (dma_buffer == dma_buffer1) {
    desc = &dma_desc1;
    dma_buffer = dma_buffer2;
  } else {
    desc = &dma_desc2;
    dma_buffer = dma_buffer1;
  }

  // Reset the AFIFO while the bus is idle, then start GDMA *before* the
  // CKV/LE pin sequence below, so the DMA has time to fetch the descriptor
  // and prime the LCD AFIFO before lcd_start (esp-idf's i80 driver inserts
  // a delay here for the same reason).  The pin sequence takes ≥1us, so it
  // doubles as the prefill window at zero added row time.
  //
  // Note: the right-edge "image repeated ~16px apart" artifact once blamed
  // on this prefill race was actually the panel's source-driver shift chain
  // needing extra flush clocks — fixed by Config::row_pad_bytes (see
  // How_It_Works.md §7).  GDMA underflow flags confirmed the FIFO never
  // starved with this ordering.
  LCD_CAM.lcd_misc.lcd_afifo_reset = 1;
  gdma_start(dma_chan, (intptr_t)desc);

