go-go-golems/esp32-s3-m5/0110-papers3-epd-density-step-response/components/epd_painter/src/EPD_Painter.cpp
  if (firstLine) {
    _pin_spv->set(false);
    _pin_ckv->set(false);
    EPD_DELAY_US(1);
    _pin_ckv->set(true);
    _pin_spv->set(true);
  } else {
    _pin_le->set(true);
    _pin_le->set(false);
    _pin_ckv->set(false);
    EPD_DELAY_US(1);
    _pin_ckv->set(true);
  }

  LCD_CAM.lcd_user.lcd_start = 1;
  if (lastLine) {
    while (LCD_CAM.lcd_user.lcd_start) {}

    _pin_ckv->set(false);
    _pin_le->set(true);
    _pin_le->set(false);
    _pin_ckv->set(true);
  }
}

// =============================================================================
// begin()
// =============================================================================
bool EPD_Painter::begin() {

  #ifdef EPD_PAINTER_PRESET_AUTO
    if (!autoDetectBoard()) return false;
  #endif

  // -- Start I2C if needed.
#ifdef ARDUINO
  if (_config.i2c.scl != -1 && _config.i2c.wire == nullptr) {
    TwoWire *w = new TwoWire(0);
    w->begin(_config.i2c.sda, _config.i2c.scl, _config.i2c.freq);
    _config.i2c.wire = w;
    EPD_DELAY_MS(50);
  }
#else
  // I2C not used in ESP-IDF builds
#endif

  // ---- Configure EPD control pins in a no-drive state ----
  // Set the output latch low before enabling output so panel power and scan
  // controls cannot pulse during initialization.
  auto output_low = [](int16_t pin) {
    if (pin < 0 || epd_pin_is_sr(pin)) return;
    EPD_PIN_LOW(pin);
    EPD_PIN_OUTPUT(pin);
    EPD_PIN_LOW(pin);
  };
  output_low(_config.pin_pwr);
  output_low(_config.pin_spv);
  output_low(_config.pin_ckv);
  output_low(_config.pin_sph);
  output_low(_config.pin_oe);
  output_low(_config.pin_le);
  output_low(_config.pin_cl);


  packed_row_bytes = _config.width / 4;

  // Each row is sent with row_pad_bytes of trailing zeros: the panel's
  // source-driver shift chain has more stages than visible columns, so the
  // real pixel data needs extra CL clocks to reach the far (right-hand) end
  // before LE latches. Without the pad the last ~16 columns repeat content
  // from further left. Zero bytes are neutral drive — electrically harmless —
  // and cost ~50ns per row. See How_It_Works.md §7.
  const int dma_row_bytes = packed_row_bytes + _config.row_pad_bytes;

  // ---- Enable and reset LCD_CAM peripheral ----
  periph_module_enable(PERIPH_LCD_CAM_MODULE);
  periph_module_reset(PERIPH_LCD_CAM_MODULE);
  LCD_CAM.lcd_user.lcd_reset = 1;
  EPD_DELAY_US(100);

  // ---- Configure LCD_CAM pixel clock ----
  LCD_CAM.lcd_clock.clk_en = 1;
  LCD_CAM.lcd_clock.lcd_clk_sel = 2;
  LCD_CAM.lcd_clock.lcd_ck_out_edge = 0;
  LCD_CAM.lcd_clock.lcd_ck_idle_edge = 0;
  LCD_CAM.lcd_clock.lcd_clk_equ_sysclk = 0;
  LCD_CAM.lcd_clock.lcd_clkm_div_num = 1;
  LCD_CAM.lcd_clock.lcd_clkm_div_a = 0;
  LCD_CAM.lcd_clock.lcd_clkm_div_b = 0;
  LCD_CAM.lcd_clock.lcd_clkcnt_n = 1;

  // ---- Configure LCD_CAM for i8080 8-bit parallel mode ----
  LCD_CAM.lcd_ctrl.lcd_rgb_mode_en = 0;
  LCD_CAM.lcd_rgb_yuv.lcd_conv_bypass = 0;
  LCD_CAM.lcd_misc.lcd_next_frame_en = 0;
  LCD_CAM.lcd_data_dout_mode.val = 0;
  LCD_CAM.lcd_user.lcd_always_out_en = 0;
  LCD_CAM.lcd_user.lcd_8bits_order = 0;
  LCD_CAM.lcd_user.lcd_bit_order = 0;
  LCD_CAM.lcd_user.lcd_2byte_en = 0;
  LCD_CAM.lcd_user.lcd_dummy = 0;
  LCD_CAM.lcd_user.lcd_dummy_cyclelen = 0;
  LCD_CAM.lcd_user.lcd_cmd = 0;
  LCD_CAM.lcd_user.lcd_dout_cyclelen = dma_row_bytes - 1;
  LCD_CAM.lcd_user.lcd_dout = 1;
  LCD_CAM.lcd_user.lcd_update = 1;

  // ---- Route 8-bit data bus pins using config ----
  for (int i = 0; i < 8; i++) {
    int8_t pin = _config.data_pins[i];
    gpio_set_level((gpio_num_t)pin, 0);
    gpio_set_direction((gpio_num_t)pin, GPIO_MODE_OUTPUT);
    esp_rom_gpio_connect_out_signal(pin, kDataSignals[i], false, false);
    epd_gpio_func_sel(pin);
    gpio_set_drive_capability((gpio_num_t)pin, (gpio_drive_cap_t)3);
  }

  // ---- Route pixel clock to CL pin ----
  esp_rom_gpio_connect_out_signal(_config.pin_cl, LCD_PCLK_IDX, false, false);
  epd_gpio_func_sel(_config.pin_cl);
  gpio_set_drive_capability((gpio_num_t)_config.pin_cl, (gpio_drive_cap_t)3);

  // ---- Allocate GDMA channel ----
  gdma_channel_alloc_config_t dma_chan_config = {
    .sibling_chan = NULL,
    .direction = GDMA_CHANNEL_DIRECTION_TX,
    .flags = { .reserve_sibling = 0, .isr_cache_safe = 0 },
  };
  esp_err_t dma_err = gdma_new_ahb_channel(&dma_chan_config, &dma_chan);
  if (dma_err != ESP_OK || !dma_chan) {
    printf("[EPD] gdma_new_channel failed: %s\n", esp_err_to_name(dma_err));
    driveSafeState();
    return false;
  }
  dma_err = gdma_connect(dma_chan, GDMA_MAKE_TRIGGER(GDMA_TRIG_PERIPH_LCD, 0));
  if (dma_err != ESP_OK) {
    printf("[EPD] gdma_connect failed: %s\n", esp_err_to_name(dma_err));
    gdma_del_channel(dma_chan);
    dma_chan = nullptr;
    driveSafeState();
    return false;
  }

  // Cache the GDMA channel index for direct register access in sendRow().
  // LCD_CAM is peripheral 5 in the GDMA peri_sel register.
  _dma_channel_id = 0;
  for (int i = 0; i < 5; i++) {
    if (GDMA.channel[i].out.peri_sel.sel == 5) { _dma_channel_id = i; break; }
  }

  gdma_strategy_config_t strategy_config = {
    .owner_check = false,
    .auto_update_desc = false,
    .eof_till_data_popped = false,
  };
  dma_err = gdma_apply_strategy(dma_chan, &strategy_config);
  if (dma_err != ESP_OK) {
    printf("[EPD] gdma_apply_strategy failed: %s\n", esp_err_to_name(dma_err));
    gdma_disconnect(dma_chan);
    gdma_del_channel(dma_chan);
    dma_chan = nullptr;
    driveSafeState();
    return false;
  }

  // ---- Allocate DMA row buffers ----
  dma_buffer1 = static_cast<uint8_t *>(
    heap_caps_aligned_alloc(16, dma_row_bytes, MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL));
  dma_buffer2 = static_cast<uint8_t *>(
    heap_caps_aligned_alloc(16, dma_row_bytes, MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL));
  if (!dma_buffer1 || !dma_buffer2) {
    printf("[EPD] DMA row-buffer allocation failed: a=%p b=%p bytes=%d\n",
           dma_buffer1, dma_buffer2, dma_row_bytes);
    driveSafeState();
    return false;
  }

  // Zero both buffers once so the pad region stays neutral forever —
  // pixel converts only ever write the first packed_row_bytes.
  memset(dma_buffer1, 0x00, dma_row_bytes);
  memset(dma_buffer2, 0x00, dma_row_bytes);

  dma_buffer = dma_buffer1;

  // ---- Set up DMA descriptors (one per buffer, stopped after each row) ----
  dma_desc2.dw0.suc_eof = 1;
  dma_desc2.dw0.size = dma_row_bytes;
  dma_desc2.dw0.length = dma_row_bytes;
  dma_desc2.buffer = const_cast<uint8_t *>(dma_buffer2);
  dma_desc2.next = nullptr;

  dma_desc1.dw0.suc_eof = 1;
  dma_desc1.dw0.size = dma_row_bytes;
  dma_desc1.dw0.length = dma_row_bytes;
  dma_desc1.buffer = const_cast<uint8_t *>(dma_buffer1);
  dma_desc1.next = nullptr;

  // ---- Allocate packed 2bpp framebuffers ----
  const size_t packed_size = (_config.width * _config.height) / 4;

