go-go-golems/esp32-s3-m5/0110-papers3-epd-density-step-response/components/epd_painter/src/EPD_Painter.cpp
  // Prefer internal RAM for speed, fall back to PSRAM if the contiguous
  // internal-heap block isn't available (e.g. after WiFi has been brought
  // up first — leaves the heap fragmented).  PSRAM-backed fastbuffer is
  // slower for the per-pixel ops in epd_painter_ink() but boots cleanly.
  packed_fastbuffer = static_cast<uint8_t *>(
    heap_caps_aligned_alloc(16, packed_size, MALLOC_CAP_INTERNAL));
  if (!packed_fastbuffer) {
    printf("[EPD] packed_fastbuffer: internal alloc failed, retrying in PSRAM\n");
    packed_fastbuffer = static_cast<uint8_t *>(
      heap_caps_aligned_alloc(16, packed_size, MALLOC_CAP_SPIRAM));
  }

  packed_screenbuffer = static_cast<uint8_t *>(
    heap_caps_aligned_alloc(16, packed_size, MALLOC_CAP_SPIRAM));
  packed_paintbuffer = static_cast<uint8_t *>(
    heap_caps_aligned_alloc(16, packed_size, MALLOC_CAP_SPIRAM));

  bitmask = static_cast<uint32_t *>(
    heap_caps_aligned_alloc(4, _config.height * 4, MALLOC_CAP_INTERNAL));

  if (!(packed_fastbuffer && packed_screenbuffer && packed_paintbuffer && bitmask)) {
    printf("[EPD] packed-buffer allocation failed: fast=%p screen=%p paint=%p mask=%p\n",
           packed_fastbuffer, packed_screenbuffer, packed_paintbuffer, bitmask);
    driveSafeState();
    return false;
  }
  memset(packed_fastbuffer, 0, packed_size);
  memset(packed_screenbuffer, 0, packed_size);
  memset(packed_paintbuffer, 0, packed_size);
  memset(bitmask, 0, _config.height * sizeof(*bitmask));

  // ── Create the power driver for this board ──
  if (_config.power.tps_addr != -1) {
    printf("\n── PowerCtl Init ──\n");
    auto* pc = new epd_painter_powerctl();
    if (!pc->begin(_config)) {
      printf("FATAL: powerctl init failed!\n");
      while (1) EPD_DELAY_MS(1000);
    }
    _powerDriver = pc;
  } else if (_config.shift.data >= 0) {
    if (_config.shift.driver == Shift::H716) {
      auto* h716 = new EPD_H716PowerDriver();
      h716->begin(_config.shift);
      _powerDriver = h716;
    } else {
      auto* h752 = new epd_painter_powerctl_74HCT4094D();
      h752->begin(_config);
      _powerDriver = h752;
    }
    _shiftReg = _powerDriver->isrController();
  } else {
    _powerDriver = new EPD_GpioPowerDriver(_config.pin_oe, _config.pin_pwr);
  }

  // ── Create per-pin drivers (GPIO or SR, determined by preset encoding) ──
  auto make_pin = [this](int16_t p) -> EPD_PinDriver* {
    if (epd_pin_is_sr(p)) return new EPD_SRPin(_shiftReg, epd_pin_sr_bit(p));
    return new EPD_GpioPin(uint8_t(p));
  };
  _pin_spv = make_pin(_config.pin_spv);
  _pin_ckv = make_pin(uint8_t(_config.pin_ckv));
  _pin_le  = make_pin(_config.pin_le);
  _pin_sph = make_pin(uint8_t(_config.pin_sph));

  if (!(_powerDriver && _pin_spv && _pin_ckv && _pin_le && _pin_sph)) {
    printf("[EPD] power/control driver allocation failed\n");
    driveSafeState();
    return false;
  }

  _paint_active_sem = xSemaphoreCreateBinary();
  _paint_buffer_sem = xSemaphoreCreateBinary();
  if (!_paint_active_sem || !_paint_buffer_sem) {
    printf("[EPD] paint semaphore allocation failed\n");
    driveSafeState();
    return false;
  }
  xSemaphoreGive(_paint_active_sem);
  xSemaphoreGive(_paint_buffer_sem);

  if (!PanelPowerGuard::initialize(*this)) {
    printf("[EPD] panel idle-power guard initialization failed\n");
    driveSafeState();
    return false;
  }

  if (xTaskCreatePinnedToCore(
        _paint_task_entry, "epd_paint", 8000, this, 10, &_paint_task_h, 0) != pdPASS) {
    printf("[EPD] paint task creation failed\n");
    _paint_task_h = nullptr;
    driveSafeState();
    return false;
  }

#ifndef EPD_PAINTER_DISABLE_BOOTCTL
  if (_autoShutdown) {
    EPD_BootCtl boot(*this);
    if (boot.shutdownPending()) boot.shutdown();  // [[noreturn]] on shutdown path
  }
#endif

  _initialized.store(true);
  return true;
}

// =============================================================================
// end()
// =============================================================================
bool EPD_Painter::end() {
  if (_initialized.load()) {
    waitIdle(30000);
    powerDown(5000);
  }
  _initialized.store(false);

  if (_paint_task_h) {
    vTaskDelete(_paint_task_h);
    _paint_task_h = nullptr;
  }

  if (_paint_active_sem) {
    vSemaphoreDelete(_paint_active_sem);
    _paint_active_sem = nullptr;
  }
  if (_paint_buffer_sem) {
    vSemaphoreDelete(_paint_buffer_sem);
    _paint_buffer_sem = nullptr;
  }

  if (dma_chan) {
    gdma_disconnect(dma_chan);
    gdma_del_channel(dma_chan);
    dma_chan = nullptr;
  }
  driveSafeState();
  periph_module_disable(PERIPH_LCD_CAM_MODULE);
  return true;
}

// =============================================================================
// Power control
// =============================================================================
void EPD_Painter::driveSafeState() {
  auto low_direct = [](int16_t pin) {
    if (pin >= 0 && !epd_pin_is_sr(pin)) EPD_PIN_LOW(pin);
  };
  low_direct(_config.pin_pwr);
  EPD_DELAY_US(10);
  low_direct(_config.pin_oe);
  EPD_DELAY_US(100);
  low_direct(_config.pin_spv);
  low_direct(_config.pin_ckv);
  low_direct(_config.pin_le);
  low_direct(_config.pin_sph);
}

void EPD_Painter::powerOn() {
  _pin_le->set(false);
  _pin_spv->set(false);
  _pin_sph->set(false);

  _powerDriver->powerOn();

  _pin_spv->set(false);
  _pin_ckv->set(false);
  EPD_DELAY_US(1);
  _pin_ckv->set(true);
  _pin_spv->set(true);
}

void EPD_Painter::powerOff() {
  if (_powerDriver) _powerDriver->powerOff();
  if (_pin_spv) _pin_spv->set(false);
  if (_pin_ckv) _pin_ckv->set(false);
  if (_pin_le) _pin_le->set(false);
  if (_pin_sph) _pin_sph->set(false);
}

bool EPD_Painter::waitIdle(uint32_t timeout_ms) {
  if (!_initialized.load() || !_paint_active_sem) return false;
  const TickType_t start = xTaskGetTickCount();
  const TickType_t timeout = pdMS_TO_TICKS(timeout_ms);

  while (paintStage.load() != 0) {
    if ((xTaskGetTickCount() - start) >= timeout) return false;
    vTaskDelay(pdMS_TO_TICKS(1));
  }

  const TickType_t elapsed = xTaskGetTickCount() - start;
  const TickType_t remaining = elapsed < timeout ? timeout - elapsed : 0;
  if (xSemaphoreTake(_paint_active_sem, remaining) != pdTRUE) return false;
  const bool idle = paintStage.load() == 0;
  xSemaphoreGive(_paint_active_sem);
  return idle;
}

bool EPD_Painter::powerDown(uint32_t timeout_ms) {
  return PanelPowerGuard::powerDownNow(timeout_ms);
}

bool EPD_Painter::panelPowerActive() const {
  return PanelPowerGuard::isPowerActive();
}

