go-go-golems/esp32-s3-m5/0110-papers3-epd-density-step-response/components/epd_painter/src/EPD_Painter.cpp
// Waveform tables are defined per-device in EPD_Painter_presets.h
// and stored in _config.waveforms.


// =============================================================================
// paint()
// =============================================================================
void EPD_Painter::paint(uint8_t *framebuffer) {
  xSemaphoreTake(_paint_buffer_sem, portMAX_DELAY);

#ifdef EPD_ASM_TIMING
  const int64_t _cp_t0 = esp_timer_get_time();
#endif
  if (_config.rotation == Rotation::ROTATION_CW)
    compact_pixels_rotated_cw(framebuffer, packed_paintbuffer, _config.height, _config.width);
  else if (_config.rotation == Rotation::ROTATION_180)
    compact_pixels_180(framebuffer, packed_paintbuffer, _config.width * _config.height);
  else
    epd_painter_compact_pixels(framebuffer, packed_paintbuffer, _config.width * _config.height);
#ifdef EPD_ASM_TIMING
  printf("[paint] compact_pixels: %lld us\n", esp_timer_get_time() - _cp_t0);
#endif

  paintStage=(interlace_mode?3:2);
  xSemaphoreGive(_paint_buffer_sem);

  // wait until this buffer has been picked up by the paint loop.
  while(paintStage==(interlace_mode?3:2)){
      vTaskDelay(1);
  }
}

// =============================================================================
// paintPacked() — like paint() but skips compaction; buffer is already 2bpp
// =============================================================================
void EPD_Painter::paintPacked(const uint8_t* packed) {
  xSemaphoreTake(_paint_buffer_sem, portMAX_DELAY);
  memcpy(packed_paintbuffer, packed, (_config.width * _config.height) / 4);
  paintStage = (interlace_mode ? 3 : 2);
  xSemaphoreGive(_paint_buffer_sem);

  while (paintStage == (interlace_mode ? 3 : 2)) {
    vTaskDelay(1);
  }
}

// =============================================================================
// unpaintPacked() — DC-balance pass: tells the driver the screen currently
// shows 'packed', then drives a blank (all-zero) frame so every pixel that
// was darkened gets a matching lightening pulse.
// =============================================================================
void EPD_Painter::unpaintPacked(const uint8_t* packed) {
  xSemaphoreTake(_paint_buffer_sem, portMAX_DELAY);
  memcpy(packed_screenbuffer, packed, packed_row_bytes * _config.height);
  memset(packed_paintbuffer,  0x00,  packed_row_bytes * _config.height);
  paintStage = (interlace_mode ? 3 : 2);
  xSemaphoreGive(_paint_buffer_sem);

  while (paintStage == (interlace_mode ? 3 : 2)) {
    vTaskDelay(1);
  }
}

// =============================================================================
// paintLater
// =============================================================================
void EPD_Painter::paintLater(uint8_t *framebuffer) {
    xSemaphoreTake(_paint_buffer_sem, portMAX_DELAY);
#ifdef EPD_ASM_TIMING
    const int64_t _cpl_t0 = esp_timer_get_time();
#endif
    if (_config.rotation == Rotation::ROTATION_CW)
      compact_pixels_rotated_cw(framebuffer, packed_paintbuffer, _config.height, _config.width);
    else if (_config.rotation == Rotation::ROTATION_180)
      compact_pixels_180(framebuffer, packed_paintbuffer, _config.width * _config.height);
    else
      epd_painter_compact_pixels(framebuffer, packed_paintbuffer, _config.width * _config.height);
#ifdef EPD_ASM_TIMING
    printf("[paintLater] compact_pixels: %lld us\n", esp_timer_get_time() - _cpl_t0);
#endif


    paintStage=interlace_mode?3:2;
    xSemaphoreGive(_paint_buffer_sem);
}

// =============================================================================
// _paint_task_entry() / _paint_task_body()
// =============================================================================
void EPD_Painter::_paint_task_entry(void *arg) {
  static_cast<EPD_Painter *>(arg)->_paint_task_body();
}

void EPD_Painter::_paint_task_body() {
  for (;;) {
    if (paintStage==0){
      xSemaphoreGive(_paint_active_sem);
      while(paintStage==0){
         vTaskDelay(1);
      }
      xSemaphoreTake(_paint_active_sem, portMAX_DELAY);
    }

    xSemaphoreTake(_paint_buffer_sem, portMAX_DELAY);
    memcpy(packed_fastbuffer, packed_paintbuffer, packed_row_bytes*_config.height);
    xSemaphoreGive(_paint_buffer_sem);

    paintStage-=1;

    PanelPowerGuard guard(*this);

#ifdef EPD_ASM_TIMING
    const int64_t _ink_t0 = esp_timer_get_time();
#endif
    for (int row = 0; row < _config.height; row++) {
      uint8_t *fb_row = packed_fastbuffer + row * packed_row_bytes;
      uint8_t *sb_row = packed_screenbuffer + row * packed_row_bytes;

      if (interlace_mode){
          bitmask[row] = epd_painter_ink(fb_row, sb_row, packed_row_bytes,  row%2?0xffffffff:0x00);
      } else {
          bitmask[row] = epd_painter_ink(fb_row, sb_row, packed_row_bytes,  0xffffffff);
      }
    }
#ifdef EPD_ASM_TIMING
    printf("[paint_task] epd_painter_ink (all rows): %lld us\n", esp_timer_get_time() - _ink_t0);
#endif

    const uint8_t *lt_wf;
    const uint8_t *dk_wf;
    int wf_len;

    if (_config.quality == Quality::QUALITY_FAST) {
      lt_wf = &_config.waveforms.fast_lighter[0][0];
      dk_wf = &_config.waveforms.fast_darker[0][0];
      wf_len = 7;
    } else if(_config.quality == Quality::QUALITY_NORMAL) {
      lt_wf = &_config.waveforms.normal_lighter[0][0];
      dk_wf = &_config.waveforms.normal_darker[0][0];
      wf_len = 13;
    } else {
      lt_wf = &_config.waveforms.high_lighter[0][0];
      dk_wf = &_config.waveforms.high_darker[0][0];
      wf_len = 13;
    }

#ifdef EPD_ASM_TIMING
    int64_t _conv_total = 0;
#endif
    for (uint8_t pass = 0; pass < wf_len; pass++) {
      uint8_t lighter_wf[3] = {
        (uint8_t)(lt_wf[2 * wf_len + pass] * 0x55),
        (uint8_t)(lt_wf[1 * wf_len + pass] * 0x55),
        (uint8_t)(lt_wf[0 * wf_len + pass] * 0x55)
      };
      uint8_t darker_wf[3] = {
        (uint8_t)(dk_wf[2 * wf_len + pass] * 0x55),
        (uint8_t)(dk_wf[1 * wf_len + pass] * 0x55),
        (uint8_t)(dk_wf[0 * wf_len + pass] * 0x55)
      };

      for (int row = 0; row < _config.height; row++) {
        uint8_t *fb_row = packed_fastbuffer + row * packed_row_bytes;
#ifdef EPD_ASM_TIMING
        const int64_t _conv_t0 = esp_timer_get_time();
#endif
        epd_painter_convert_packed_fb_to_ink(fb_row, dma_buffer, packed_row_bytes, darker_wf, bitmask[row]);
        epd_painter_convert_packed_fb_to_ink(fb_row, dma_buffer, packed_row_bytes, lighter_wf, ~bitmask[row]);
#ifdef EPD_ASM_TIMING
        _conv_total += esp_timer_get_time() - _conv_t0;
#endif
        sendRow(row == 0, false, false);
      }

