go-go-golems/esp32-s3-m5/0110-papers3-epd-density-step-response/components/epd_painter/src/EPD_Painter.cpp
     if (_config.quality == Quality::QUALITY_HIGH) {
        EPD_DELAY_MS(8);
      } else if (_config.quality == Quality::QUALITY_NORMAL) {
        EPD_DELAY_MS(4);
      }
    }
#ifdef EPD_ASM_TIMING
    printf("[paint_task] convert_packed_fb_to_ink (all passes, all rows, darker+lighter): %lld us\n", _conv_total);
#endif

    vTaskDelay(1);  // yield once per frame: feeds WDT and lets application task run

    memset(dma_buffer1, 0x00, packed_row_bytes);
    memset(dma_buffer2, 0x00, packed_row_bytes);
    for (int row = 0; row < _config.height; ++row) {
      sendRow(row == 0, row == _config.height - 1);
    }


  }
}

// GPIO set/clear via direct register write — pins always <32
#define GPIO_SET(mask) (GPIO.out_w1ts = (mask))
#define GPIO_CLR(mask) (GPIO.out_w1tc = (mask))

// Clock one bit: set/clear data, then pulse clk
#define SHIFT_BIT(data_set, data_clr, clk_mask) \
  data_set; clk_mask; clk_mask

// =============================================================================
// clearBuffers()
// Zero all packed pixel buffers so the DC-balance baseline is reset.
// Call this after painting a shutdown image and before cutting power, so that
// on the next boot unpaintPacked() works from a clean white baseline rather
// than the painted state that was left in PSRAM.
// =============================================================================
void EPD_Painter::clearBuffers() {
  const size_t packed_bytes = (size_t)_config.width * _config.height / 4;
  if (packed_fastbuffer)   memset(packed_fastbuffer,   0, packed_bytes);
  if (packed_screenbuffer) memset(packed_screenbuffer, 0, packed_bytes);
  if (packed_paintbuffer)  memset(packed_paintbuffer,  0, packed_bytes);
}

// =============================================================================
// computeDirtyRects()
// Scans packed_screenbuffer vs packed_paintbuffer row by row.  Each row is
// checked byte-by-byte (1 byte = 4 pixels at 2bpp) to find the leftmost and
// rightmost changed byte.
//
// Rows are grouped into rectangles.  When a clean row is encountered inside an
// open rectangle the "wasted" pixel count grows by (rect_width × 4).  Once
// wasted exceeds tolerance the rectangle is closed at the last dirty row and a
// new one will be opened at the next dirty row.
//
// tolerance = 0  → only consecutive dirty rows are merged (tight rects)
// tolerance = large → everything collapses toward a single full-screen rect
// =============================================================================
int EPD_Painter::computeDirtyRects(Rect* out_rects, int max_rects, int tolerance) const {
    if (!packed_screenbuffer || !packed_paintbuffer || max_rects <= 0) return 0;

    const int prb = _config.width / 4;
    const int H   = _config.height;

    int  count   = 0;
    bool open    = false;
    int  rect_y0 = 0, rect_y1 = 0;
    int  rect_bx0 = 0, rect_bx1 = 0;
    int  wasted  = 0;

    for (int row = 0; row < H && count < max_rects; row++) {
        const uint8_t* s = packed_screenbuffer + row * prb;
        const uint8_t* p = packed_paintbuffer  + row * prb;

        // Find changed byte span for this row
        int bx0 = prb, bx1 = 0;
        for (int bx = 0; bx < prb; bx++) {
            if (s[bx] != p[bx]) {
                if (bx < bx0) bx0 = bx;
                bx1 = bx + 1;
            }
        }
        const bool dirty = (bx0 < bx1);

        if (dirty) {
            if (!open) {
                open     = true;
                rect_y0  = row;
                rect_y1  = row + 1;
                rect_bx0 = bx0;
                rect_bx1 = bx1;
                wasted   = 0;
            } else {
                if (bx0 < rect_bx0) rect_bx0 = bx0;
                if (bx1 > rect_bx1) rect_bx1 = bx1;
                rect_y1 = row + 1;
                wasted  = 0;
            }
        } else if (open) {
            wasted += (rect_bx1 - rect_bx0) * 4;
            if (wasted > tolerance) {
                out_rects[count++] = {
                    (int16_t)(rect_bx0 * 4),
                    (int16_t) rect_y0,
                    (int16_t)((rect_bx1 - rect_bx0) * 4),
                    (int16_t)(rect_y1 - rect_y0)
                };
                open = false;
            }
        }
    }

    if (open && count < max_rects) {
        out_rects[count++] = {
            (int16_t)(rect_bx0 * 4),
            (int16_t) rect_y0,
            (int16_t)((rect_bx1 - rect_bx0) * 4),
            (int16_t)(rect_y1 - rect_y0)
        };
    }

    return count;
}

// =============================================================================
// clearDirtyAreas()
// =============================================================================
void EPD_Painter::clearDirtyAreas(uint8_t* framebuffer, int tolerance, ClearMode mode) {
    // Compact 8bpp framebuffer into packed_paintbuffer (same as paint()).
    xSemaphoreTake(_paint_buffer_sem, portMAX_DELAY);
    if (_config.rotation == Rotation::ROTATION_CW)
        compact_pixels_rotated_cw(framebuffer, packed_paintbuffer, _config.height, _config.width);
    else if (_config.rotation == Rotation::ROTATION_180)
        compact_pixels_180(framebuffer, packed_paintbuffer, _config.width * _config.height);
    else
        epd_painter_compact_pixels(framebuffer, packed_paintbuffer, _config.width * _config.height);
    xSemaphoreGive(_paint_buffer_sem);

    Rect rects[32];
    int n = computeDirtyRects(rects, 32, tolerance);
    if (n > 0)
        clear(rects, n, mode);
}

// =============================================================================
// clear()
// Optional rects array restricts clearing to those regions only.
// =============================================================================
void EPD_Painter::clear(const Rect* rects, int num_rects, ClearMode mode) {

  const bool partial = (rects != nullptr && num_rects > 0);

  PanelPowerGuard guard(*this);

  const int prb = _config.width / 4;  // packed row bytes

  // Paint white into the affected area of the paint buffer.
  xSemaphoreTake(_paint_buffer_sem, portMAX_DELAY);
  if (!partial) {
    memset(packed_paintbuffer, 0x00, prb * _config.height);
  } else {
    for (int r = 0; r < num_rects; r++) {
      int bx0 = rects[r].x / 4;
      int bx1 = (rects[r].x + rects[r].w + 3) / 4;
      if (bx1 > prb) bx1 = prb;
      int y0  = rects[r].y;
      int y1  = rects[r].y + rects[r].h;
      if (y1 > _config.height) y1 = _config.height;
      for (int row = y0; row < y1; row++)
        memset(packed_paintbuffer + row * prb + bx0, 0x00, bx1 - bx0);
    }
  }
  paintStage = 1;
  xSemaphoreGive(_paint_buffer_sem);

  while (paintStage == 1) {
    vTaskDelay(1);
  }

