go-go-golems/esp32-s3-m5/0110-papers3-epd-density-step-response/components/epd_painter/src/EPD_Painter.cpp
  xSemaphoreTake(_paint_active_sem, portMAX_DELAY);

  dma_buffer = dma_buffer1;

  // Hardware clear phases.
  int num_phases;
  int totpass[4];
  if (mode == ClearMode::SOFT) {
    num_phases = 2;
    totpass[0] = 1; totpass[1] = 1;
  } else {
    num_phases = 4;
    totpass[0] = 6; totpass[1] = 2; totpass[2] = 4; totpass[3] = 8;
  }
  for (int phase = 0; phase < num_phases; phase++) {

    uint8_t pattern = (phase % 2 == 0) ? 0b01010101 : 0b10101010;

    for (int passes = 0; passes < totpass[phase]; passes++) {
      for (int row = 0; row < _config.height; ++row) {
        if (!partial) {
          memset(dma_buffer, pattern, prb);
        } else {
          memset(dma_buffer, 0x00, prb);
          for (int r = 0; r < num_rects; r++) {
            if (row >= rects[r].y && row < rects[r].y + rects[r].h) {
              int bx0 = rects[r].x / 4;
              int bx1 = (rects[r].x + rects[r].w + 3) / 4;
              if (bx1 > prb) bx1 = prb;
              memset(dma_buffer + bx0, pattern, bx1 - bx0);
            }
          }
        }
        sendRow(row == 0);
      }
      EPD_DELAY_MS(5);
    }
  }

  // Send neutral to close out all rows.
  memset(dma_buffer1, 0x00, prb);
  memset(dma_buffer2, 0x00, prb);
  for (int row = 0; row < _config.height; ++row) {
    sendRow(row == 0, row == _config.height - 1);
  }

  xSemaphoreGive(_paint_active_sem);
}
// =============================================================================
// fxClear() — sweeping bar clear effect
//
// A thick bar travels left-to-right across the panel. Within the bar, each
// pixel is independently and randomly driven black or white on every pass,
// so adjacent pixels may be heading in opposite directions — the "fuzz".
// Left of the bar, pixels are settled white; right of the bar they are driven
// black and wait for the bar to sweep over them.
//
// Tuning constants (pixels, dimensionless):
//   BAR_W   — width of the active bar
//   STEP    — columns advanced per step
//   NPASSES — render passes per step (more = slower but better clearing)
// =============================================================================
void EPD_Painter::fxClear() {
  const int prb = _config.width / 4;   // packed row bytes

  // Wait for any in-progress paint to finish, then take exclusive control.
  // Unlike clear(), we do NOT issue a white frame first — the screenbuffer
  // must still reflect the current display state for the pixel mask to work.
  xSemaphoreTake(_paint_active_sem, portMAX_DELAY);

  PanelPowerGuard guard(*this);

  const int H = _config.height;

  dma_buffer = dma_buffer1;

  // All white (0b00) screenbuffer pixels are driven fully black in the dark
  // zone and fully white in the light zone — no partial selection. This gives
  // maximum contrast: a solid black leading edge and a solid white trailing
  // edge. DC balance is maintained because dark and light zones are equal size.
  const int BAR_DARK  = 180;   // rows of black voltage (leading edge)
  const int BAR_LIGHT = 180;   // rows of white voltage (trailing edge)
  const int BAR_H     = BAR_DARK + BAR_LIGHT;
  const int STEP      = 15;    // 1 row per step → 60 dark + 60 light pulses per pixel

  for (int bar_top = -BAR_H; bar_top <= H; bar_top += STEP) {
    const int dark_top = bar_top + BAR_LIGHT;   // dark zone: lower (leading) half
    const int bar_bot  = bar_top + BAR_H;

    for (int row = 0; row < H; row++) {
      uint32_t* buf32 = reinterpret_cast<uint32_t*>(dma_buffer);

      if (row >= bar_top && row < dark_top) {
        // Light phase (upper/trailing): all white pixels → white voltage
        for (int i = 0; i < prb / 4; i++) {
          const uint32_t* sb32 = reinterpret_cast<const uint32_t*>(packed_screenbuffer + row * prb) + i;
          uint32_t either     = (*sb32 | (*sb32 >> 1)) & 0x55555555u;
          uint32_t pixel_mask = ~(either | (either << 1));
          buf32[i] = 0xAAAAAAAAu & pixel_mask;
        }
      } else if (row >= dark_top && row < bar_bot) {
        // Dark phase (lower/leading): all white pixels → black voltage
        for (int i = 0; i < prb / 4; i++) {
          const uint32_t* sb32 = reinterpret_cast<const uint32_t*>(packed_screenbuffer + row * prb) + i;
          uint32_t either     = (*sb32 | (*sb32 >> 1)) & 0x55555555u;
          uint32_t pixel_mask = ~(either | (either << 1));
          buf32[i] = 0x55555555u & pixel_mask;
        }
      } else {
        memset(dma_buffer, 0x00, prb);
      }
      sendRow(row == 0, false);
    }
  }


  // Final neutral flush — de-energise all pixels
  memset(dma_buffer1, 0x00, prb);
  memset(dma_buffer2, 0x00, prb);
  for (int row = 0; row < H; ++row) {
    sendRow(row == 0, row == H - 1);
  }

  // Screenbuffer is unchanged — non-white pixels were never driven, white pixels
  // were already 0x00. No update needed.

  xSemaphoreGive(_paint_active_sem);
}


// =============================================================================
// dither()
//
// Converts an 8bpp greyscale framebuffer (0=black … 255=white) in-place to
// the driver's 4-level encoding:  0=white  1=light-grey  2=dark-grey  3=black
//
// Algorithm: Floyd-Steinberg error diffusion.
// A single row of int16 scratch (next_err[width]) carries the below-row error
// forward so the main buffer never needs to be widened beyond uint8.
//
// Error distribution:
//          [x]  →  right:        7/16
//   below-left:  3/16   below:  5/16   below-right:  1/16
// =============================================================================
void EPD_Painter::dither(uint8_t* fb, uint16_t width, uint16_t height) {
    // Representative 8bpp values for each 2bpp level (0=white … 3=black)
    static const uint8_t kLevel8[4] = { 255, 170, 85, 0 };

    int16_t* next_err = (int16_t*)heap_caps_malloc(
        (size_t)width * sizeof(int16_t), MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    if (!next_err) return;
    memset(next_err, 0, (size_t)width * sizeof(int16_t));

    for (uint16_t y = 0; y < height; y++) {
        uint8_t* row = fb + (size_t)y * width;
        int16_t carry = 0;

