go-go-golems/esp32-s3-m5/0110-papers3-epd-density-step-response/components/epd_painter/src/EPD_Painter.cpp
        for (uint16_t x = 0; x < width; x++) {
            int32_t val = (int32_t)row[x] + carry + next_err[x];
            next_err[x] = 0;
            if (val < 0)   val = 0;
            if (val > 255) val = 255;

            // Quantise to nearest level (0=white … 3=black)
            uint8_t q;
            if      (val >= 213) q = 0;  // white
            else if (val >= 128) q = 1;  // light grey
            else if (val >= 43)  q = 2;  // dark grey
            else                 q = 3;  // black

            row[x] = q;

            int32_t err = val - (int32_t)kLevel8[q];

            carry = (err * 7) >> 4;
            if (y + 1 < height) {
                if (x > 0) {
                    next_err[x - 1] += (int16_t)((err * 3) >> 4);
                }
                next_err[x] += (int16_t)((err * 5) >> 4);
                if (x + 1 < width) next_err[x + 1] += (int16_t)((err * 1) >> 4);
            }
        }
    }

    heap_caps_free(next_err);
}

// =============================================================================
// packBuffer()
// =============================================================================
uint8_t* EPD_Painter::packBuffer(const uint8_t* fb) const {
    const size_t packed_size = (size_t)_config.width * _config.height / 4;
    uint8_t* buf = static_cast<uint8_t*>(
        heap_caps_aligned_alloc(16, packed_size, MALLOC_CAP_SPIRAM));
    if (!buf) return nullptr;
    if (_config.rotation == Rotation::ROTATION_CW)
        compact_pixels_rotated_cw(fb, buf, _config.height, _config.width);
    else if (_config.rotation == Rotation::ROTATION_180)
        compact_pixels_180(fb, buf, (uint32_t)_config.width * _config.height);
    else
        epd_painter_compact_pixels(fb, buf, (uint32_t)_config.width * _config.height);
    return buf;
}

// =============================================================================
// autoDetectBoard()
//
// AUTO preset fallback used by begin().
//
// If the user did not select a board explicitly, EPD_PAINTER_PRESET is built
// with placeholder pins and this function probes the known board I2C buses to
// find a matching preset at runtime.
//
// Returns true when a supported board is detected and _config has been replaced
// with the matching preset. Returns false when no known board responds, so
// begin() can fail cleanly instead of continuing with an invalid configuration.
// =============================================================================
bool EPD_Painter::autoDetectBoard() {
  #ifdef ARDUINO
    if (_config.data_pins[0] >= 0) return true;

    Rotation _rotation = _config.rotation;
    int i = 1;
    for (const auto& probe : Probe) {
      printf("[EPD] Probing board %d on SDA=%d, SCL=%d, addr=0x%x\n", i, probe.i2c_sda, probe.i2c_scl, probe.i2c_addr);
      TwoWire _w(1);   // use bus 1 just for the probe; will be deleted
      _w.begin(probe.i2c_sda, probe.i2c_scl, 100000);
      // Suppress ESP-IDF i2c_master NACK error logs — a NACK simply means
      // this board isn't here, which is expected for every non-matching probe.
      esp_log_level_set("i2c.master", ESP_LOG_NONE);
      _w.beginTransmission(probe.i2c_addr);
      bool found = (_w.endTransmission() == 0);
      esp_log_level_set("i2c.master", ESP_LOG_WARN);
      _w.end();
      // Reset Pins to output
      EPD_PIN_OUTPUT(probe.i2c_sda);
      EPD_PIN_OUTPUT(probe.i2c_scl);
      if(found) {
        printf("[EPD] Board %d found\n", i);
        _config = *probe.preset;
        _preset = probe.preset;
        _config.rotation = _rotation;  // preserve user-specified rotation across auto-detect
        printf("[EPD] Detected panel details: \n - I2C SDA: %d\n - I2C SCL: %d\n", _config.i2c.sda, _config.i2c.scl);
        return true;
      }
      ++i;
    }

    printf("[EPD] No known board found; begin() will fail\n");
    return false;

  #else
    return false;
  #endif
}
